%用基本高斯消元法求得使原矩阵变为上三角矩阵
a=[6 -2 2 4;12 -8 6 10;3 -13 9 3; -6 4 1 -18];
a=Gaussian(a)

%GaussianBacksub方法 答案：1 -3 -2 1
a=[6 -2 2 4;12 -8 6 10;3 -13 9 3; -6 4 1 -18];b=[12;34;27;-38];
x=GaussianBacksub(a,b)

%行尺度主元高斯消元法的分解部分
a=[2 3 -6;1 -6 8;3 -2 1];
[a,p]=FacScaleGaussian(a)

%行尺度主元高斯消元法 答案：1 2 -2 -7
b=[-1 1 2 0];a=[-3 1 0 0;1 0 0 0;3 2 -1 1;-2 2 1 0]
x=ScaleGaussian(a,b)

%已知l与u求解x， 答案：1 -3 -2 1
l=[1 0 0 0;1/2 1 0 0;-1 -1/6 1 0;2 1/3 -2/13 1];
u=[6 -2 2 4;0 -12 8 1;0 0 13/3 -83/6;0 0 0 -6/13];
b=[12 34 27 -38];p =[1 3 4 2];
x=luGaussian(l,u,b,p)

%由高斯过程产生的a矩阵
a =[ 6             -2              2              4       
       2              1/3           -2/13          -6/13    
       1/2          -12              8              1       
      -1             -1/6           13/3          -83/6 ] ;   

b=[12 34 27 -38];p =[1 3 4 2];
x=aGaussian(a,b,p)

%tri举例 答案：1 -5/18 -5/18 5/9 1/9
format rat
a=[2 3 2 1];b=[1 2 0 -1 1];c=[0 -1 1 1];d=[1 1 -1 -1 4];
x=tri(a,b,c,d)

%acGaussian 举例 注意：其中的c是由A得到的，但程序中的a_ij是经过高斯算法得到的
%答案：1 1 1 原方程a=[1 2 3;4 5 7; 7 8 9]
a =[ 1/7  6/7 12/7;4/7 1/2 1;7 8 9]; c=[12 15 19];
p =[3 1 2];
y=acGaussian(a,c,p)
a =[ 2/3 13/3  -20/3 ;1/3  -16/13  -7/13 ;3  -2  1 ]; p=[ 3 1 2];
   c=[4 7 -13];
